app/controllers/posts_controller.rb

  def index
    @post =  Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESK

  def create
        @post = Post.new(post_params)
        @post.email = current_user.email
    if @post.save
---
INSERT INTO "posts" ("content", "ancestry", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "BIO_WULF_WULF_WULF"], ["ancestry", "127"], ["email", "scarytys@gmail.com"], ["created_at", "2016-11-22 06:07:28.220345"], ["updated_at", "2016-11-22 06:07:28.220345"]]